[
  {
    "company": "Rigetti Computing",
    "title": "2026 Internship Project: Software Engineering, Computer Vision & Automation",
    "location": "Fremont, CA",
    "url": "https://jobs.lever.co/rigetti/40442388-ca66-4899-ab45-d8a2658bd050",
    "job_id": "40442388-ca66-4899-ab45-d8a2658bd050",
    "team": "Fab Operations",
    "commitment": "Intern",
    "description": "<div><span style=\"font-size: 16px\">Rigetti is seeking a motivated student (Bachelor’s, Master’s, or PhD in CS, SWE, or related field) to develop a production-oriented, on-premise data automation and computer vision solution. This is an applied engineering role focused on building operational systems intended for future production integration rather than academic research.</span></div><div><br></div><div><span style=\"font-size: 16px\">The intern will develop a Python backend to process structured inspection data and apply image classification, design a retrainable model workflow, and contribute to a lightweight web UI for reviewing results. The intern will work closely with Defect Metrology and Software Engineering teams to ensure domain accuracy and production-quality implementation. This role is ideal for students pursuing industry careers in software engineering, machine learning engineering, or applied AI.</span></div><div><br></div><div><span style=\"font-size: 18px\">Educational Value</span></div><div><span style=\"font-size: 16px\">Gain hands-on experience building a production-oriented computer vision system in an industrial environment. The internship provides exposure to backend automation, machine learning integration, retraining workflows, and lightweight full-stack development. Skills developed align directly with industry roles in Software Engineering, Machine Learning Engineering, and Applied AI.</span></div><div><br></div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Key Responsibilities</span></div>",
    "portal": "lever",
    "posted_at": "1772218103699",
    "scraped_at": "2026-02-28T23:33:28.282707Z",
    "first_discovered": "2026-02-28T23:35:15.349930+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  }
]