[
  {
    "company": "Plaid",
    "title": "Data Engineer  - Data Engineering",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/0dc0a0f9-7c59-468c-8bc7-8918a09d24d4",
    "job_id": "0dc0a0f9-7c59-468c-8bc7-8918a09d24d4",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 9pt;\">The main goal of the DE team in 2024-25 is to build robust golden data sets to power our business goals of creating more insights based products.&nbsp;Making data-driven decisions is key to Plaid's culture. To support that, we need to scale our data systems while maintaining correct and complete data. We provide tooling and guidance to teams across engineering, product, and business and help them explore our data quickly and safely to get the data insights they need, which ultimately helps Plaid serve our customers more effectively.&nbsp;Data Engineers heavily leverage SQL and Python to build data workflows. We use tools like DBT, Airflow, Redshift, ElasticSearch, Atlanta, and Retool to orchestrate data pipelines and define workflows. We work with engineers, product managers, business intelligence, data analysts, and many other teams to build Plaid's data strategy and a data-first mindset. Our engineering culture is IC-driven -- we favor bottom-up ideation and empowerment of our incredibly talented team. We are looking for engineers who are motivated by creating impact for our consumers and customers, growing together as a team, shipping the MVP, and leaving things better than we found them.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">You will be in a high impact role that will directly enable business leaders to make faster and more informed business judgements based on the datasets you build. You will have the opportunity to carve out the ownership and scope of internal datasets and visualizations across Plaid which is a currently unowned area that we intend to take over and build SLAs on. You will have the opportunity to learn best practices and up-level your technical skills from our strong DE team and from the broader Data Platform team. You will collaborate with and have strong and cross functional partnerships with literally all teams at Plaid from Engineering to Product to Marketing/Finance etc.</span></div>",
    "portal": "lever",
    "posted_at": "1747190117383",
    "scraped_at": "2026-02-05T03:03:09.269485Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Data Scientist - Fraud",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/619ed4a1-1bfb-4ad9-8309-b073135ec771",
    "job_id": "619ed4a1-1bfb-4ad9-8309-b073135ec771",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Data team within Plaid’s Fraud organization builds the machine learning systems that power Plaid’s newest fraud detection products, leveraging the breadth of Plaid’s network data to stop fraud before it occurs. We manage the full lifecycle of these systems—from feature pipeline development and model training to deployment, serving, and monitoring—ensuring our solutions scale reliably as we grow to support hundreds of customers.</div><div><br></div><div>As a Data Scientist on Plaid’s Fraud Data team, you will analyze customer and network traffic to understand how Protect performs across different segments and use cases. You’ll build dashboards and performance metrics that create a clear, shared view of product health for both the team and our go-to-market partners. You will run backtests on customer traffic to evaluate model and rule performance, uncover high-value opportunities, and generate insights that support sales motions and customer expansion. You’ll also design the underlying data models and schemas that enable efficient, reliable analysis and reporting. In close partnership with Product and Engineering, you will help design and evaluate experiments that shape new customer-facing features and inform the future of our fraud products.</div><div><br></div><div>***We are open to remote candidates***</div>",
    "portal": "lever",
    "posted_at": "1763486741883",
    "scraped_at": "2026-02-05T03:03:09.269493Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Data Scientist - Network Value",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/18503c02-17a0-4c47-98c8-155b0b6ccc2a",
    "job_id": "18503c02-17a0-4c47-98c8-155b0b6ccc2a",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Network Value Data Science team is helping Plaid build an industry leading fintech consumer network by increasing access to, authorization for, and usability of Plaid’s User’s financial footprints. We embed within product teams to support OKRs and help execute on product roadmaps. We translate ambiguous product questions into tractable analysis, serve as analytical thought partners throughout the org, identify opportunities to build better products, and champion a data-first decision making approach everywhere we go.</div><div><br></div><div>You’ll be a Data Scientist supporting Network Enablement Access (NEA). In this role, you’ll help build an industry-leading fintech consumer network by expanding access to, authorization for, and usability of Plaid users’ financial footprints. You’ll partner closely with embedded teams to support product goals and roadmaps, ensuring Plaid continues to deliver trusted, innovative, and scalable solutions that empower consumers to connect and use their financial data with confidence..</div>",
    "portal": "lever",
    "posted_at": "1769818028287",
    "scraped_at": "2026-02-05T03:03:09.269499Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Data Scientist - Payments",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/0106d105-641d-49f6-a605-4ea64b8c4bf7",
    "job_id": "0106d105-641d-49f6-a605-4ea64b8c4bf7",
    "team": "Engineering",
    "commitment": "",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s Data team is building data insights and models that improve how millions of users understand and grow their financial lives. We're looking for data scientists with experience applying state-of-the-art data analytics techniques to different product areas. We value not only technical know-how, but also creativity, user empathy, and teamwork.</div><div><br></div><div>You’ll be a data scientist as a part of the Data organization, contributing to diverse, high-impact data insights and machine learning challenges. Specifically, you will focus on driving business impact, and production directions through data analysis and potentially help evaluate and improve ML solutions and systems. If you're interested in building state-of-the-art Data/ML solutions to unblock financial freedom for everyone, let's chat!</div>",
    "portal": "lever",
    "posted_at": "1760980354346",
    "scraped_at": "2026-02-05T03:03:09.269504Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Credit Distribution",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/d40b3f7b-cdaa-441d-8d4a-6aad9a5f6a1b",
    "job_id": "d40b3f7b-cdaa-441d-8d4a-6aad9a5f6a1b",
    "team": "Engineering",
    "commitment": "",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">The Credit team is building the future of lending by making cash flow data as ubiquitous and trusted as traditional credit data. Our mission is to expand access to more affordable credit by empowering lenders with real-time financial data that improves risk assessment and decision-making at scale. We own the expansion of distribution channels for our Credit products by leading the development of solutions and integrations that unlock new customer segments and use cases across the credit ecosystem. Our ecosystem strategy continues to strengthen our market position through partnerships with major players. We bring deep expertise across lending sub-sectors to understand market structure, core customer needs, and the most effective channels to reach each segment.&nbsp;By combining strong technical execution with market insight, we aim to grow overall adoption of cash flow data and meaningfully expand its role in modern credit decisioning.</span></div>",
    "portal": "lever",
    "posted_at": "1769619272359",
    "scraped_at": "2026-02-05T03:03:09.269514Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Intelligent Tooling",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/5731dc74-0cf9-43ab-98db-c5e961370e7d",
    "job_id": "5731dc74-0cf9-43ab-98db-c5e961370e7d",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 9pt;\">Plaid is evolving into an AI-first company, and Intelligent Tooling sits at the center of that transformation. The Intelligent Tooling team is being built from the ground up, and our mission is to establish the technical foundations, operating model, and internal platforms that embed AI deeply into Plaid’s coding tools, internal systems, and the entire software development lifecycle.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">When we are successful, engineers across Plaid will delegate lower-leverage work to AI agents, move faster with confidence, and spend more of their time designing and inventing for customers. Intelligent Tooling owns the platforms and systems that make this possible - from AI coding integrations and SDLC agents to the internal tools that power Plaid’s operations.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">As the Engineering Manager for Intelligent Tooling, you will lead an engineering team responsible for some of the highest-leverage systems at Plaid. This role is central to executing Plaid’s 2026 engineering strategy to supercharge the engineering organization with AI tooling, and requires a leader who can both build the team and personally operate at the frontier of AI-powered developer workflows to drive real, organization-wide change.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">You will set direction, drive execution, and critically, ensure adoption of AI-powered tools that improve how hundreds of engineers build, test, debug, and operate software every day. This is not a research role: success is measured by real usage, real impact, and real improvements to developer experience.</span></div>",
    "portal": "lever",
    "posted_at": "1762899705358",
    "scraped_at": "2026-02-05T03:03:09.269520Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Machine Learning",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/aab9269b-9a44-4704-bf87-d9639dd48dbb",
    "job_id": "aab9269b-9a44-4704-bf87-d9639dd48dbb",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s Data organization is building models, services and platforms that improve how millions of users understand and grow their financial lives. We are looking for a tech lead manager with experience applying state-of-the-art machine learning and data science techniques in the CGX/EWA/NEA domain. We value not only technical know-how, but also creativity, user empathy, and teamwork.</div><div><br></div><div>You’ll be a Tech Lead Manager overseeing a team of Machine Learning Engineers and Data Scientists embedded across Plaid’s CGX, EWA, and NEA product areas. Your team builds and scales ML systems that power growth personalization, financial forecasting, and network insights—driving measurable impact across Plaid’s consumer experiences.</div>",
    "portal": "lever",
    "posted_at": "1760593565040",
    "scraped_at": "2026-02-05T03:03:09.269525Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Machine Learning Infrastructure",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/cdc5447e-b4c5-49f4-807a-f95656e2f1ce",
    "job_id": "cdc5447e-b4c5-49f4-807a-f95656e2f1ce",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 9pt;\">Plaid is evolving into an AI-first company, where data and machine learning are the key enablers of smarter, more secure insight products built on top of Plaid’s vast financial data network. The Machine Learning Infrastructure team sits at the center of this transformation. We build the platforms that enable model developers to experiment, train, deploy, and monitor machine learning systems reliably and at scale — from feature stores and pipelines, to deployment frameworks and inference tooling. We are in the midst of a pivotal shift: replacing legacy systems with a modern feature store, and establishing a standardized ML Ops “golden path.” Our mission is to enable Plaid’s product teams to move faster with trustworthy insights, deploy models with confidence, and unlock the next generation of AI-powered financial experiences.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">As the Engineering Manager for Machine Learning Infrastructure, you will be responsible for guiding a senior engineering team through the design, delivery, and operation of Plaid’s ML infrastructure. We are looking for a leader who combines deep technical expertise in ML infrastructure with proven experience scaling and managing senior engineering teams. You’ll ensure clarity of execution, help your team deliver high-quality systems, and partner closely with ML product teams to meet their needs. This role is execution-driven: you will translate strategy into action, remove blockers, and build a culture of ownership and technical excellence.</span></div>",
    "portal": "lever",
    "posted_at": "1757527864599",
    "scraped_at": "2026-02-05T03:03:09.269530Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Payment Risk",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/da1aae0b-ce8f-47e8-9cb8-233d8bf75a5a",
    "job_id": "da1aae0b-ce8f-47e8-9cb8-233d8bf75a5a",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Bank payments is the top way that money is moved in the US, with over $86 trillion moved over ACH in 2024. Many of these transactions are subject to risk from various sources, including liquidity, fraud, and abuse, which leads to losses and bad experiences for businesses and consumers alike.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Plaid’s Payment Risk team is building the future of bank payment risk tools and solutions, with the current version of our products already in heavy use by many of the largest names in fintech and beyond. We use proprietary AI and ML solutions to offer intelligent insights and decisions that save our customers billions of dollars, and are heavily investing in improving the power and reach of these solutions.</span></div><div><br></div><div><span style=\"font-size: 16px;\">While this team directly owns customer-facing APIs, we are also responsible for integrating these solutions into Plaid’s own money movement products. We build across the stack, including data &amp; ML infrastructure, distributed backend systems, APIs and customer-facing tooling &amp; insights.</span></div><div><br></div><div><span style=\"font-size: 16px;\">In this role, you will lead a team of engineers responsible for building and maintaining the infrastructure and systems that power both the offline and online components of the Signal Risk Platform. This role involves close partnership with the ML and data science team developing the AI and ML models that generate the transaction risk scores for customers, as well as collaboration with product counterparts to define the strategy, vision, and concrete roadmaps for both areas. A key part of your work will be to design and build APIs and Dashboard experiences used by thousands of Plaid customers, and to partner with the engineering team on technical planning and execution, ensuring the platform maintains high reliability (many 9's) and performs up to customer expectations for critical money movement flows.</span></div>",
    "portal": "lever",
    "posted_at": "1761946210322",
    "scraped_at": "2026-02-05T03:03:09.269535Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - Update Pipeline",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/a0d99be2-3c2f-459b-b09e-658c7e484120",
    "job_id": "a0d99be2-3c2f-459b-b09e-658c7e484120",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 10pt;\">Think of Update Pipeline as Plaid’s Plaid – we own the business logic and systems that power every user-present pathway (ex: anytime a user connects their bank to their favorite fintech app!), orchestrates how financial information flows into Plaid, builds shared data models, and transforms raw bank data into the rich information that Plaid products rely on.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">We do this at global scale; for the largest companies in the world (Google, Meta, Shopify, Square, Robinhood, Venmo to name just a few). </span></div><div><br></div><div><span style=\"font-size: 10pt;\">We are a high‑performing group of engineers based in San Francisco, collaborating in‑office three days a week.</span></div>",
    "portal": "lever",
    "posted_at": "1753993515298",
    "scraped_at": "2026-02-05T03:03:09.269540Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Engineering Manager - User Foundations",
    "location": "New York",
    "url": "https://jobs.lever.co/plaid/c35990c8-66e4-48ed-aecb-90ce596ddd4c",
    "job_id": "c35990c8-66e4-48ed-aecb-90ce596ddd4c",
    "team": "Engineering",
    "commitment": "",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">Plaid’s authoritative source of truth for the user lifecycle: powering recognition, authentication, and the data models behind Plaid’s newest ML-based insights products (</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://plaid.com/blog/plaid-lendscore-credit-risk-scoring/\">LendScore</a><span style=\"font-size: 10pt;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://plaid.com/blog/plaid-protect-antifraud/\">Protect</a><span style=\"font-size: 10pt;\">, etc.). We build the APIs, systems and data models that let Plaid products deliver user-level intelligence at scale.&nbsp; </span></div><div><br></div><div><span style=\"font-size: 10pt;\">At the center of our work is the living graph that represents people’s entire financial lives; the largest dataset at Plaid! This links all of Plaid’s users, identities, accounts, and transactions. We operate it reliably at global scale for some of the world’s largest companies, including Google, Meta, Shopify, Square, Robinhood, and Venmo. </span></div><div><br></div><div><span style=\"font-size: 10pt;\">The team owns 3 core pillars: </span></div><div><span style=\"font-size: 10pt;\">- The User Graph: Defines Plaid’s global user and maintains the graph linking identities, accounts, and transactions, exposed via internal APIs for product development and ML inference. </span></div><div><span style=\"font-size: 10pt;\">- The User API: Plaid’s newest API surface, enabling easy multi-product integration and powering fraud prevention, credit decisioning and pre-qualification capabilities, and other data partner insights. </span></div><div><span style=\"font-size: 10pt;\">- The User Decisioning Layer, which powers returning user recognition and authentication across Link and API-only experiences.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">We tackle hard problems in identity, graph integrity, and trust so product, ML, and data teams can build reliable fraud, credit, and financial management experiences at U.S. financial network scale.We are a high‑performing group of engineers based in San Francisco and New York, collaborating in‑office.</span></div>",
    "portal": "lever",
    "posted_at": "1768933971993",
    "scraped_at": "2026-02-05T03:03:09.269545Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Experienced Engineering Manager - Customer Growth & Experience",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/f1631596-3d91-4d68-894d-bd80bb68f610",
    "job_id": "f1631596-3d91-4d68-894d-bd80bb68f610",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">The Customer Growth and Experience (CGX) org's mission is to accelerate customer velocity and create delightful experiences at the most pivotal stages of our customers’ journeys with Plaid.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We achieve this in three ways:</span></div><div><br></div><div><span style=\"font-size: 16px;\">1/ Driving revenue acquisition, accelerating customer launch and activation, and&nbsp;scaling usage. </span></div><div><span style=\"font-size: 16px;\">2/ Increasing the operating efficiency of our GTM and GTM supporting teams (NBs, AEs, AMs, Support, Implementation, TAMs, Customer Oversight, Finance, and Commercial).</span></div><div><span style=\"font-size: 16px;\">3/ Enhancing the developer experience and the experience of all emerging dashboard personas.</span></div><div><br></div><div><span style=\"font-size: 16px;\">You will lead an engineering organization of 35+ people spread across teams focused on growth, developer relations, developer experience (including Plaid's public API and external MCP servers), customer onboarding, the developer dashboard, and billing.</span></div>",
    "portal": "lever",
    "posted_at": "1758058352638",
    "scraped_at": "2026-02-05T03:03:09.269555Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Finance Systems Manager",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/3665397b-7c4c-438c-9051-0b7c01586f9a",
    "job_id": "3665397b-7c4c-438c-9051-0b7c01586f9a",
    "team": "Finance",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are building a world-class Finance Systems team at Plaid to optimize finance operations and reporting. We work cross-functionally with Accounting, FP&amp;A, Procurement, Legal, Engineering, and Security&nbsp; to ensure our finance stack is reliable, secure, and scalable. </span></div><div><br></div><div><span style=\"font-size: 16px;\">&nbsp;As a </span><b style=\"font-size: 16px;\">Finance Systems Lead</b><span style=\"font-size: 16px;\">, you’ll manage and optimize Plaid’s NetSuite ERP and related financial applications. You’ll help drive automation and improve data integrity across our finance tech stack. You’ll be hands-on with integrations, workflows, reporting tools, and system configurations. Your work will directly support critical finance processes and strategic scaling initiatives.</span></div>",
    "portal": "lever",
    "posted_at": "1770247507694",
    "scraped_at": "2026-02-05T03:03:09.269565Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Machine Learning Engineer - Data Foundation and AI",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/3e655ff7-a8fd-4ffd-abc1-fcf39aa07a60",
    "job_id": "3e655ff7-a8fd-4ffd-abc1-fcf39aa07a60",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Data Foundation &amp; AI team builds advanced ML/AI models and applications that enable product teams to deliver intelligence at scale. We design infrastructure and abstractions that make AI development faster, more reliable, and more impactful. From embeddings and representation learning to applied AI systems, our work provides the building blocks for the next generation of financial services on Plaid.</div><div><br></div><div>You’ll be a machine learning engineer on the Data Foundation &amp; AI team. In this role, you will design, build, and scale advanced ML/AI systems that power Plaid products and applications. Your work may span developing reliable distributed training and serving systems, improving ML operations at scale, and building AI-powered applications that enable new product experiences.</div>",
    "portal": "lever",
    "posted_at": "1760591656303",
    "scraped_at": "2026-02-05T03:03:09.269590Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Macro & Credit Research Economist",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/582b1c72-e531-4e71-ba80-09956c1163eb",
    "job_id": "582b1c72-e531-4e71-ba80-09956c1163eb",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">The Macro &amp; Economic Insights team is responsible for translating Plaid’s unique, high-frequency transaction and balance data into rigorous, forward-looking insights about household financial health, credit dynamics, and the broader economic cycle. The team builds internal indicators, research outputs, and external-facing analysis that leverage Plaid’s data advantage to inform strategy, products, and market narratives.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">As the Macro and Credit Research Economist, you will build and own macroeconomic and credit indicators derived directly from raw transaction data. You will develop forecasting models, identify economic turning points, and produce rigorous analysis that informs internal decisions and external research.</span></div>",
    "portal": "lever",
    "posted_at": "1769638681215",
    "scraped_at": "2026-02-05T03:03:09.269595Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Marketing Strategy and Operations Analyst",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/b5311b97-bc98-4219-a3c9-efcd994243d0",
    "job_id": "b5311b97-bc98-4219-a3c9-efcd994243d0",
    "team": "GTM Operations",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Our team builds the foundation that empowers Plaid’s new business and marketing functions to operate efficiently, scale strategically, and align with the company’s broader goals. We drive operational excellence while supporting the creation and execution of impactful top of funnel strategies that resonate with our target audiences. We focus on supporting marketing and the new business teams in delivering strategies that drive sustainable growth and foster long-term success. We are committed to building a strong, operationally excellent growth engine that supports Plaid’s customer acquisition and expansion.</div><div><br></div><div>As a GTM Operations Analyst, you will drive decision-making across Marketing and New Business teams by leading strategic analysis, performance measurement, and forecasting initiatives. You will serve as a trusted partner to leadership, delivering insights that shape investment, planning, and optimization decisions across channels. You bring deep expertise in full-funnel performance and efficiency metrics, combining analytical rigor with business intuition to translate raw data into strategic insight. This is a dynamic, problem-solving role focused on continuously improving analytics and processes, evolving how performance is measured to meet the changing needs of a growing business.</div>",
    "portal": "lever",
    "posted_at": "1760565232870",
    "scraped_at": "2026-02-05T03:03:09.269608Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Sales Engineer - Fintech",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/83a90e0a-d4c8-42f4-a3ac-729a0d256b42",
    "job_id": "83a90e0a-d4c8-42f4-a3ac-729a0d256b42",
    "team": "Sales",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Sales Engineering unlocks and empowers prospects’ full potential on the Plaid Network. We bring product expertise and drive Revenue outcomes by being customer-obsessed technical advisors in the pre-sales process. You’ll work closely with our Fintech Sales team as the technical lead during the pre-sales process. You will be responsible for partnering with Account Executives, proactively pushing deals forward by overcoming technical objections and building solutions around Plaid products. You will ensure a successful transition to the post-sale stage of the customer lifecycle and partner with account teams to drive adoption of new products by existing customers. You will be expected to have significant knowledge of the Fintech ecosystem and a deep understanding of how customers can best utilize Plaid.</div>",
    "portal": "lever",
    "posted_at": "1764862116123",
    "scraped_at": "2026-02-05T03:03:09.269684Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Data Engineer - Data Engineering",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/022278b3-0943-44b3-a54b-1de421017589",
    "job_id": "022278b3-0943-44b3-a54b-1de421017589",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div>We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam. #LI-Hybrid</div><div><br></div><div><span style=\"font-size: 9pt;\">The main goal of the DE team in 2024-25 is to build robust golden data sets to power our business goals of creating more insights based products.&nbsp;Making data-driven decisions is key to Plaid's culture. To support that, we need to scale our data systems while maintaining correct and complete data. We provide tooling and guidance to teams across engineering, product, and business and help them explore our data quickly and safely to get the data insights they need, which ultimately helps Plaid serve our customers more effectively.&nbsp;Data Engineers heavily leverage SQL and Python to build data workflows. We use tools like DBT, Airflow, Redshift, ElasticSearch, Atlanta, and Retool to orchestrate data pipelines and define workflows. We work with engineers, product managers, business intelligence, data analysts, and many other teams to build Plaid's data strategy and a data-first mindset. Our engineering culture is IC-driven -- we favor bottom-up ideation and empowerment of our incredibly talented team. We are looking for engineers who are motivated by creating impact for our consumers and customers, growing together as a team, shipping the MVP, and leaving things better than we found them.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">You will be in a high impact role that will directly enable business leaders to make faster and more informed business judgements based on the datasets you build. You will have the opportunity to carve out the ownership and scope of internal datasets and visualizations across Plaid which is a currently unowned area that we intend to take over and build SLAs on. You will have the opportunity to learn best practices and up-level your technical skills from our strong DE team and from the broader Data Platform team. You will collaborate with and have strong and cross functional partnerships with literally all teams at Plaid from Engineering to Product to Marketing/Finance etc.</span></div>",
    "portal": "lever",
    "posted_at": "1731717372208",
    "scraped_at": "2026-02-05T03:03:09.269698Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Machine Learning Engineer - Payments",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/b7d3a770-946b-4b08-92d3-e02506742066",
    "job_id": "b7d3a770-946b-4b08-92d3-e02506742066",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div>We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam. #LI-Remote</div><div><br></div><div>Plaid’s Machine Learning team is building models that improve how millions of users understand and grow their financial lives. We're looking for machine learning engineers with experience applying state-of-the-art machine learning and modeling techniques -- including natural language processing, anomaly detection, optimization, and time series forecasting -- toward different product areas. We value not only technical know-how, but also creativity, user empathy, and teamwork.</div><div><br></div><div>You’ll be a machine learning engineer as a part of the core ML payments team, contributing to diverse, high-impact machine learning challenges. Specifically, you will focus on designing, building and deploying scalable ML solutions and systems. You will lead the efforts to experiment with new modeling approaches and strategies, as well as collaborating closely with a skilled team of engineers on ingesting signals and productionizing these models. If you're interested in building the state of art AI/ML solutions to unblock financial freedom for everyone, let's chat!</div>",
    "portal": "lever",
    "posted_at": "1769104460600",
    "scraped_at": "2026-02-05T03:03:09.269703Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Security Engineer - Offensive Security",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/df916036-7e1d-486d-beb1-9104845efdb0",
    "job_id": "df916036-7e1d-486d-beb1-9104845efdb0",
    "team": "Security",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Platform Security (PlatSec) team protects Plaid’s corporate and production environments, spanning endpoint and infrastructure security as well as detection and response. We work to minimize the risk of compromise by hardening laptops and production services, identifying attacks early, and responding decisively when issues arise.</div><div><br></div><div>As the founding member of Plaid’s red team, you will establish and define our offensive security program. You’ll determine which types of operations we should run in both the short and long term, and then carry them out, shifting between strategic planning and hands-on technical work throughout the year. You’ll partner with stakeholders to understand the issues you uncover, both high level and granular, and to incorporate the red team’s work into day-to-day operations and long-term planning. You’ll communicate findings to stakeholders at all levels, including the C-team.</div><div><br></div><div>Over the next few years, you’ll help grow the team by interviewing candidates for new roles and potentially stepping into a management or TL position.</div>",
    "portal": "lever",
    "posted_at": "1763660317368",
    "scraped_at": "2026-02-05T03:03:09.269707Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - AI & Intelligent Tooling",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/9d0008bb-dc57-47a1-90ce-46cd3145445d",
    "job_id": "9d0008bb-dc57-47a1-90ce-46cd3145445d",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 11pt;\">Plaid is evolving into an AI-first company, and Intelligent Tooling sits at the center of that transformation. The Intelligent Tooling team is being built from the ground up, and our mission is to establish the technical foundations, operating model, and internal platforms that embed AI deeply into Plaid’s coding tools, internal systems, and the entire software development lifecycle.When we are successful, engineers across Plaid will delegate lower-leverage work to AI agents, move faster with confidence, and spend more of their time designing and inventing for customers. Intelligent Tooling owns the platforms and systems that make this possible - from AI coding integrations and SDLC agents to the internal tools that power Plaid’s operations.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">As a Senior Software Engineer on the Intelligent Tooling team, you will build and operate internal systems that directly impact how engineers across Plaid do their work. This is a hands-on role with significant ownership, where success is measured by real adoption, reliability, and improvements to developer experience.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You will work on AI-powered tooling, internal platforms, and developer workflows, collaborating closely with other engineers and cross-functional partners to ship durable, high-leverage systems.</span></div>",
    "portal": "lever",
    "posted_at": "1767902324748",
    "scraped_at": "2026-02-05T03:03:09.269712Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Backend",
    "location": "New York",
    "url": "https://jobs.lever.co/plaid/0e7c6766-a599-4c5f-80a9-36164c45d93e",
    "job_id": "0e7c6766-a599-4c5f-80a9-36164c45d93e",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div>",
    "portal": "lever",
    "posted_at": "1727129280620",
    "scraped_at": "2026-02-05T03:03:09.269717Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Backend",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/cdfaadbd-7cae-479c-94fc-538a610cf4f0",
    "job_id": "cdfaadbd-7cae-479c-94fc-538a610cf4f0",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div>",
    "portal": "lever",
    "posted_at": "1727207942783",
    "scraped_at": "2026-02-05T03:03:09.269721Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Data Infrastructure",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/05b0ae3f-ec60-48d6-ae27-1bd89d928c47",
    "job_id": "05b0ae3f-ec60-48d6-ae27-1bd89d928c47",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 11pt;\">Making data driven decisions is key to Plaid's culture. To support that, we need to scale our data systems while maintaining correct and complete data. We provide tooling and guidance to teams across engineering, product, and business and help them explore our data quickly and safely to get the data insights they need, which ultimately helps Plaid serve our customers more effectively. We build the data and machine learning infrastructure to enable Plaid engineers to prototype and iterate on products and features built on top of consumer-permissioned financial data.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Engineers on Data Infrastructure are domain experts in Data Warehouse, Data Lakehouse, Spark, Workflow Orchestration, and Streaming technologies. We scale our existing data pipelines in a performant and cost efficient way while creating the necessary abstractions to make developing on top of this platform extremely simple for other engineers at Plaid.</span></div>",
    "portal": "lever",
    "posted_at": "1757949773106",
    "scraped_at": "2026-02-05T03:03:09.269726Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Fullstack",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/9a4fcc86-9c58-4439-9fe5-9c206cfc8dd3",
    "job_id": "9a4fcc86-9c58-4439-9fe5-9c206cfc8dd3",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s mission is to unlock financial freedom for everyone by making money movement and access to financial data simple and secure. As a Fullstack Software Engineer, you will design and build the systems and experiences that power how millions of people connect to their finances.</div><div><br></div><div>You will work across the stack, building scalable backend services and APIs while also crafting intuitive, high-quality frontend experiences that bring those systems to life. This role is ideal for engineers who enjoy switching between backend problem-solving and frontend user experience work, and who are excited to grow their impact across both.</div><div><br></div><div>You will collaborate closely with product managers, designers, and other engineers to ship products that are reliable, secure, and delightful to use. At Plaid, engineers take ownership early, contribute to architectural decisions, and see their work reach millions of users.</div>",
    "portal": "lever",
    "posted_at": "1727207986866",
    "scraped_at": "2026-02-05T03:03:09.269730Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Fullstack",
    "location": "New York",
    "url": "https://jobs.lever.co/plaid/de02fe74-6365-4aa0-8d21-fa700db3abe8",
    "job_id": "de02fe74-6365-4aa0-8d21-fa700db3abe8",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s mission is to unlock financial freedom for everyone by making money movement and access to financial data simple and secure. As a Fullstack Software Engineer, you will design and build the systems and experiences that power how millions of people connect to their finances.</div><div><br></div><div>You will work across the stack, building scalable backend services and APIs while also crafting intuitive, high-quality frontend experiences that bring those systems to life. This role is ideal for engineers who enjoy switching between backend problem-solving and frontend user experience work, and who are excited to grow their impact across both.</div><div><br></div><div>You will collaborate closely with product managers, designers, and other engineers to ship products that are reliable, secure, and delightful to use. At Plaid, engineers take ownership early, contribute to architectural decisions, and see their work reach millions of users.</div>",
    "portal": "lever",
    "posted_at": "1727128830321",
    "scraped_at": "2026-02-05T03:03:09.269735Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - ML Infrastructure",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/16383203-9942-42be-9698-76207e2a500e",
    "job_id": "16383203-9942-42be-9698-76207e2a500e",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div>Plaid is evolving into an AI-first company, where data and machine learning are the key enablers of smarter, more secure insight products built on top of Plaid’s vast financial data network. The Machine Learning Infrastructure team sits at the center of this transformation. We build the platforms that enable model developers to experiment, train, deploy, and monitor machine learning systems reliably and at scale — from feature stores and pipelines, to deployment frameworks and inference tooling.</div><div><br></div><div>We are in the midst of a pivotal shift: replacing legacy systems with a modern feature store, and establishing a standardized ML Ops “golden path.” Our mission is to enable Plaid’s product teams to move faster with trustworthy insights, deploy models with confidence, and unlock the next generation of AI-powered financial experiences.</div><div><br></div><div>As a Senior Software Engineer on the Machine Learning Infrastructure team, you will design, build, and operate the systems that power machine learning across Plaid. You will apply your deep technical expertise to create scalable, reliable, and secure ML platforms, and collaborate closely with ML product teams to accelerate the delivery of ML &amp; AI-powered products.</div><div><br></div><div>This is a highly technical, hands-on role where you’ll contribute to core infrastructure, influence architectural direction, and mentor peers while helping to define the “golden path” for ML development and deployment at Plaid.</div>",
    "portal": "lever",
    "posted_at": "1757953826217",
    "scraped_at": "2026-02-05T03:03:09.269739Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Software Engineer - Network Enablement (Applied ML)",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/43b1374d-5c5e-4b63-b710-a95e3cb76bbe",
    "job_id": "43b1374d-5c5e-4b63-b710-a95e3cb76bbe",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 16px;\">The Network Enablement team’s mission is to amplify Plaid’s network effects by fostering trust and sharing intelligence with data partners.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We build Trust &amp; Fraud Insights (real-time Protect model scoring, two-way APIs/webhooks, and investigation tooling), Bank Intelligence (ML driven retention and account-primacy metrics and scalable batch pipelines), and the ml/data foundations (graph and sequence-embedding models plus unified feature pipelines and feature-store patterns).</span></div><div><br></div><div><span style=\"font-size: 16px;\">We own productionization and reliability for data partner facing ML — low-latency scoring, offline↔online parity, observability and drift detection, PII-safe handling and auditability — and collaborated closely with MLE, DS, Data Platform, Fraud, Foundational Modeling, Product, and Privacy to scale network intelligence.</span></div><div><br></div><div><span style=\"font-size: 16px;\">On this team you will build and operate the ML infrastructure and product services that enable trust and intelligence across Plaid’s network. You’ll own feature engineering, offline training and batch scoring, online feature serving, and real-time inference so model outputs directly power partner-facing fraud &amp; trust products and bank intelligence features. You will integrate inference into product logic (APIs, feature flags, backend flows), build reproducible pipelines and model CI/CD, and ensure observability, reproducibility, and compliance as you scale our network capabilities. You’ll partner with Product, ML/Data Platform, Fraud, Foundational Modeling, MLE, DS, and Privacy to ship auditable, reliable ML solutions that move product KPIs</span></div>",
    "portal": "lever",
    "posted_at": "1754342962196",
    "scraped_at": "2026-02-05T03:03:09.269744Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Software Engineer",
    "location": "New York",
    "url": "https://jobs.lever.co/plaid/49139a62-a9bc-4400-ae89-789818b34cb8",
    "job_id": "49139a62-a9bc-4400-ae89-789818b34cb8",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s mission is to unlock financial freedom for everyone by making money movement and access to financial data simple and secure. As a Software Engineer, you will design and build the systems that power how millions of people connect to their finances. You will work across the stack, from reliable backend services and APIs to intuitive applications that bring those systems to life. You will collaborate with engineers, product managers, and designers to ship products that make financial services more accessible and transparent. At Plaid, engineers take ownership early, grow quickly, and see their work reach millions of users.</div>",
    "portal": "lever",
    "posted_at": "1749230501679",
    "scraped_at": "2026-02-05T03:03:09.269753Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Software Engineer",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/f456f4fa-a9f7-4673-892a-8943e3cfa3fe",
    "job_id": "f456f4fa-a9f7-4673-892a-8943e3cfa3fe",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s mission is to unlock financial freedom for everyone by making money movement and access to financial data simple and secure. As a Software Engineer, you will design and build the systems that power how millions of people connect to their finances. You will work across the stack, from reliable backend services and APIs to intuitive applications that bring those systems to life. You will collaborate with engineers, product managers, and designers to ship products that make financial services more accessible and transparent. At Plaid, engineers take ownership early, grow quickly, and see their work reach millions of users.</div>",
    "portal": "lever",
    "posted_at": "1724870763809",
    "scraped_at": "2026-02-05T03:03:09.269757Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Software Engineer - Platform",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/2b9a141e-0669-4197-aa52-2b07d9fadc96",
    "job_id": "2b9a141e-0669-4197-aa52-2b07d9fadc96",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Plaid’s Platform Engineering organization comprises multiple teams focused on core infrastructure, data platforms, storage, privacy, and developer efficiency. Together, these teams ensure that Plaid’s technology platform is scalable, reliable, and secure to support our rapid growth. Our infrastructure handles millions of requests per day, and we pride ourselves on maintaining highly robust and performant systems. As a Platform Engineer, you will design, build, and maintain the foundational infrastructure and internal platforms that empower all of Plaid’s engineering teams to move quickly and safely. You’ll work cross-functionally with product engineering squads to ship new features and ensure operational excellence throughout each product’s lifecycle.&nbsp;&nbsp;</span></div>",
    "portal": "lever",
    "posted_at": "1755794364103",
    "scraped_at": "2026-02-05T03:03:09.269762Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Machine Learning Engineer - Fraud Data",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/b999e686-0d02-4a97-91c2-04912350173c",
    "job_id": "b999e686-0d02-4a97-91c2-04912350173c",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Data team within Plaid’s Fraud organization builds the machine learning systems that power Plaid’s cutting-edge fraud detection products. By leveraging Plaid’s extensive network data, we enable proactive fraud prevention—stopping fraud before it happens. Our team owns the entire ML lifecycle, from developing feature pipelines and training models to deploying and monitoring them in production. We ensure that our systems scale reliably and efficiently as Plaid continues to grow and support hundreds of customers.</div><div><br></div><div>As a Staff Machine Learning Engineer on Plaid’s Fraud Data team, you will design and build scalable ML infrastructure that powers our industry-leading fraud detection product. You’ll lead the evolution of our model deployment, monitoring, and observability frameworks to ensure high reliability and performance at scale. Collaborating closely with teams across ML Infrastructure, Product, and Engineering, you’ll deliver robust systems that protect users and customers from fraud. In addition, you’ll mentor other engineers and help shape the long-term technical vision and strategy of the Fraud Data team.</div><div><br></div><div>***We are open to remote candidates for this role***</div>",
    "portal": "lever",
    "posted_at": "1760595605017",
    "scraped_at": "2026-02-05T03:03:09.269767Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Product Manager - AI Foundations",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/2f79ded3-c9b3-407d-b3c1-da42d5e95693",
    "job_id": "2f79ded3-c9b3-407d-b3c1-da42d5e95693",
    "team": "Product",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s Product team builds the network that powers the future of financial services. Our mission is to unlock financial freedom for everyone through open finance. Product Managers at Plaid are curious, customer-obsessed, and move quickly to deliver value. They take ownership, sweat the details, and make sound decisions with imperfect information.</div><div><br></div><div>As a Product Manager on the AI Foundations team, you will drive Plaid’s AI strategy by building the data and intelligence layer that powers smarter financial experiences. You will work across engineering, data science, and research to develop scalable AI systems—from core embeddings and representation learning to applied model integrations that enhance developer and consumer outcomes.</div><div><br></div><div>This role is for an experienced PM who thrives at the intersection of AI and platform products. You are technically fluent, strategic, and execution-oriented. You enjoy turning advanced machine-learning capabilities into reliable, trusted infrastructure that scales across Plaid’s ecosystem.</div>",
    "portal": "lever",
    "posted_at": "1763095720055",
    "scraped_at": "2026-02-05T03:03:09.269771Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Product Manager - API & Developer Experience",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/2c06ab7d-0925-46be-a79e-73c014022898",
    "job_id": "2c06ab7d-0925-46be-a79e-73c014022898",
    "team": "Product",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Developer Experience (DevX) team at Plaid empowers developers to build the next generation of financial services. We own all of the surfaces that developers touch first. Our mission is to make it fast, easy, and delightful for developers to integrate with Plaid.</div><div><br></div><div>As the Product Manager for Developer Experience, you will be the strategic leader responsible for how developers first encounter, understand and integrate with Plaid. You will be the voice of developers building on our platform, driving the roadmap across APIs and docs, SDKs and sandbox to integration tooling. You will lead the charge in making Plaid the best API platform for developers, whether they're solo builders or building at scale in enterprises. </div><div><br></div><div>This is a highly cross-functional role where you collaborate with engineers, designers, developer relations, Go-to-Market, and support to create magical, frictionless developer journeys.</div>",
    "portal": "lever",
    "posted_at": "1748993850708",
    "scraped_at": "2026-02-05T03:03:09.269777Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Software Engineer - AI",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/a6bf6eeb-6486-4e45-a3b2-e712f32523d3",
    "job_id": "a6bf6eeb-6486-4e45-a3b2-e712f32523d3",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 16px;\">AI and intelligent systems are driving the fifth paradigm shift, following previous technological revolutions like mainframes, personal computers, the internet, and mobile devices.&nbsp;We believe, in the foreseeable future, AI will revolutionize the FinTech industry - from how consumers understand and manage their finances, to how developers build applications and how all companies operate. The fintech industry landscape will undergo a fundamental reshape.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px;\">Plaid in the FinTech AI Ecosystem</b></div><div><span style=\"font-size: 16px;\">Plaid is uniquely positioned to become the financial data and insights backbone for AI applications and platforms in this evolving ecosystem.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">We believe consumers should be able to understand and manage their financial life through conversational AI interfaces using natural language. We believe consumers should have peace of mind with a trustworthy consent and authorization manager when agents shop for them. We believe identity verification and financial fraud prevention in AI-powered products should feel seamless and embedded for the end users. The list goes on.</span></div><div><span style=\"font-size: 16px;\">The most important AI companies, major fintechs, and customer agent platforms are actively trying to integrate Plaid into AI-powered products and solutions they build.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px;\">Plaid’s AI-powered Experiences for Customers</b></div><div><span style=\"font-size: 16px;\">The explosive growth in model intelligence and increasing relevance for enterprise tasks offer a unique opportunity for Plaid to rethink from the ground up how we operate and interact with our customers for the most optimal experience.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">Our early experiments in building AI agents for customer experience are paying off with huge business value. For example, our homegrown AI-powered customer support agents resolve a significant proportion of customer questions and issues within seconds, which would otherwise have required humans hours to work on.&nbsp;</span></div><div><span style=\"font-size: 16px;\">This is just the beginning and there is so much more we could do.</span></div><div><br></div><div><b style=\"font-size: 16px;\">The AI Applications Team</b></div><div><span style=\"font-size: 16px;\">You will have the opportunity to join as one of the founding members of this newly formed team that is dedicated to consolidating and rapidly scaling our successful bets so far, and grow with the team in our quest to accelerate Plaid’s transformation into an AI-first company.</span></div><div><br></div><div><span style=\"font-size: 16px;\">In this role you will lead projects that enable and scale our business with our largest AI customers and partners, starting with personal finance use cases and expanding into many others; examples include:</span></div><div><span style=\"font-size: 16px;\">- Develop and evolve the preferred integration pattern for Plaid with AI providers - from API adaptations to building the official Plaid MCP Servers, and beyond</span></div><div><span style=\"font-size: 16px;\">- Redefine how Plaid’s consumer link experience embed into conversational interfaces in the most seamless way</span></div><div><span style=\"font-size: 16px;\">Architect the trust layer for the future of agentic commerce that will become the industry standard</span></div><div><br></div><div><span style=\"font-size: 16px;\">Additionally you will be expected to scale and extend our existing successful bets on AI-powered customer experience; examples include:</span></div><div><span style=\"font-size: 16px;\">- Make the next step-function improvement in our homegrown customer support agent - land our multi-turn and multi-agent system that powers a truly delightful experience for our customers; define how to scalably run offline evaluation for complex multi-turn open-ended tasks; research and prototype how Human-In-The-Loop - Reinforcement Learning (RLHF) can power an insights flywheel; pioneer the architecture for customer-specific long-term memory, etc.</span></div><div><span style=\"font-size: 16px;\">- Extend our agentic system to support other critical parts of the customer journey, starting with areas with the highest ROI - top-of-funnel product recommendation, customer onboarding and risk diligence, customer activation and assistance for faster productionization, as well as upselling and cross-selling of Plaid products</span></div><div><br></div><div><span style=\"font-size: 16px;\">You will have a front row seat to all the latest industry developments. Over time, with the skills and experience you develop and hone on this team, you can become an influential voice in defining where AI &lt;&gt; Fintech will be heading longer term.</span></div>",
    "portal": "lever",
    "posted_at": "1767999671098",
    "scraped_at": "2026-02-05T03:03:09.269787Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Software Engineer - Money Movement",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/0a94e7cb-1f30-40d8-ae09-899200091386",
    "job_id": "0a94e7cb-1f30-40d8-ae09-899200091386",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 16px;\">At Plaid, our mission is to build the infrastructure that makes financial services more accessible and reliable—enabling businesses and consumers to move money and manage finances with trust and scale. The Payments Transfer team is central to that mission: we build a multi-rail payment platform to move money between bank accounts for millions of people in the United States.</span></div><div><br></div><div><span style=\"font-size: 16px;\">You will define the future architecture of our Payments Transfer systems, ensuring they are reliable, scalable, and built for long-term growth. Additionally, you will execute against an ambitious product roadmap while partnering closely with product and cross-functional teams.</span></div>",
    "portal": "lever",
    "posted_at": "1764020162325",
    "scraped_at": "2026-02-05T03:03:09.269792Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Software Engineer - Product Foundations",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/55eecfac-b1cc-4660-a728-ae840bc9a267",
    "job_id": "55eecfac-b1cc-4660-a728-ae840bc9a267",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">Network Foundations is Plaid’s authoritative source of truth for the user lifecycle, powering user recognition across integration paths, authentication with Plaid, intelligent and context-aware onboarding flows, and the core user data models that drive insights for Plaid’s newest ML-based products.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We own the living graph of people’s financial lives — and we operate it at global scale for some of the world’s largest companies, including Google, Meta, Shopify, Square, Robinhood, and Venmo.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Our mission is to make Plaid’s network data easy to query, highly accurate, and legally compliant. The infrastructure we build is used by product and machine learning teams across the company to develop high-precision features, analytics, and customer experiences. We focus on enabling consistent data access across both real-time and offline workflows.</span></div>",
    "portal": "lever",
    "posted_at": "1755056300194",
    "scraped_at": "2026-02-05T03:03:09.269796Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Software Engineer - Security Infrastructure",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/fdfd7a43-862b-4b9d-b642-2be82cc989b5",
    "job_id": "fdfd7a43-862b-4b9d-b642-2be82cc989b5",
    "team": "Security",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">At Plaid, security isn't a cost center or a compliance checklist—it is our product. We sit at the intersection of thousands of applications, thousands of financial institutions, and hundreds of millions of consumers. We are the trust layer for the fintech ecosystem. If we don't build secure systems, the ecosystem doesn't function. </span></div><div><br></div><div><span style=\"font-size: 11pt;\">You will join a team responsible for the secure backbone of Plaid. As we look toward 2026, you will have the opportunity to define industry standards in areas like:</span></div><div><b style=\"font-size: 11pt;\">Next-Generation Authorization:</b><span style=\"font-size: 11pt;\"> We are moving beyond simple RBAC. You will help build a unified, centralized Authorization Platform that enforces fine-grained permissions across all human and non-human identities.</span></div><div><b style=\"font-size: 11pt;\">Agentic Security Capabilities:</b><span style=\"font-size: 11pt;\">&nbsp;Build AI agents and tooling to automate functions like vulnerability patching, secure code reviews, and anomaly detection.</span></div><div><b style=\"font-size: 11pt;\">Zero Trust Architecture:</b><span style=\"font-size: 11pt;\"> You will evolve our internal token services and identity gateways to enforce rigorous Zero Trust controls for every service, device, and user in our fleet.</span></div><div><b style=\"font-size: 11pt;\">AI Guardrails:</b><span style=\"font-size: 11pt;\"> As Plaid adopts GenAI, you will build the \"guardrails\" and paved roads that allow our engineers to use LLMs securely, preventing data leakage and model abuse before they happen.</span></div><div><b style=\"font-size: 11pt;\">Cryptographic Services:</b><span style=\"font-size: 11pt;\"> You will own and scale our internal Key Management Systems, the central services for encryption, signing, and key rotation that protect our most sensitive data.</span></div><div><b style=\"font-size: 11pt;\">Network Security:</b><span style=\"font-size: 11pt;\"> You will help us sandbox our sensitive workloads from the internet, preventing command-and-control and data exfiltration.</span></div>",
    "portal": "lever",
    "posted_at": "1765475952846",
    "scraped_at": "2026-02-05T03:03:09.269800Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Staff Technical Program Manager - FinOps",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/acb399b1-e0f8-45f3-bffa-c89c9c573a12",
    "job_id": "acb399b1-e0f8-45f3-bffa-c89c9c573a12",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The FinOps function is responsible for financial accountability, visibility, and optimization across all engineering-related spend at Plaid. This includes cloud infrastructure, AI/ML and data workloads, third-party SaaS tools, and other technical investments that support Plaid’s products and internal platforms.</div><div><br></div><div>The team operates at the intersection of Engineering, Product, and Finance, ensuring that spending decisions are transparent, intentional, and aligned with product strategy and business priorities. Rather than functioning as a cost-control or approval layer, FinOps enables teams to understand, own, and optimize their spend while maintaining engineering velocity.</div>",
    "portal": "lever",
    "posted_at": "1767996754831",
    "scraped_at": "2026-02-05T03:03:09.269804Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Technical Support Engineer",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/1e10caf7-85ed-4610-842f-78cea7d40de7",
    "job_id": "1e10caf7-85ed-4610-842f-78cea7d40de7",
    "team": "Product Support",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid Support ensures our customers' applications can help their consumers live their best financial lives by ensuring our products continue to operate as expected. We investigate the root cause of integration issues, quantify their scope and impact, and when we can’t fix them ourselves, we work with our Growth and Engineering teams to reach a solution.&nbsp;&nbsp;</div><div><br></div><div>As we continue to grow, we’re looking for Technical Support Engineers (TSEs) to join the team to help us balance the needs of customers, users and internal stakeholders, while navigating critical technical issues. In this role, you will manage issues from their first symptom to their eventual resolution, communicating with our customers and internal stakeholders throughout the process. People who succeed in this role tend to be empathetic, collaborative, technically minded, and most importantly - customer-centric. They have an interest in learning more about financial services, and are excited to help customers resolve complex issues. TSEs work closely with Plaid’s product and engineering teams, and we have a high technical bar to ensure that we all speak the same language. Our Support team sets aggressive goals to meet the standards our customers expect, and we collaborate cross-functionally with our Engineering, Product, Financial Access, and Go-to-Market teams in order to achieve these goals.&nbsp;This role requires candidates to be based in the Eastern Time Zone (EST/EDT) to align with customer needs and team collaboration</div>",
    "portal": "lever",
    "posted_at": "1768496406710",
    "scraped_at": "2026-02-05T03:03:09.269823Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Risk Analyst, Customer Oversight",
    "location": "New York",
    "url": "https://jobs.lever.co/plaid/8d7e55bb-6d48-4e2c-9f9f-f05d9a18681b",
    "job_id": "8d7e55bb-6d48-4e2c-9f9f-f05d9a18681b",
    "team": "Risk",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The Customer Oversight team at Plaid is a cross-functional team responsible for protecting the Plaid ecosystem by identifying, assessing, and mitigating risk throughout the customer lifecycle. The team plays a critical role in maintaining trust in the platform by ensuring our controls both protect and enable the business. Plaid is the gateway our customers use to build, launch, and scale fintech applications that expand access to financial services. In this role, you’ll be a core operator on the Customer Oversight team, supporting day-to-day risk operations through customer onboarding and ongoing monitoring. You’ll review new and existing customers, conduct risk assessments, and take action in accordance with established policies and procedures.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll partner closely with teams across Go-To-Market, Security Engineering, Legal, and Financial Access to resolve cases efficiently, escalate risks when appropriate, and ensure customers can onboard and operate safely on the platform. This role is well-suited for someone who is detail-oriented, execution-focused, and excited to learn how risk management operates at scale in a fast-growing fintech environment.</span></div>",
    "portal": "lever",
    "posted_at": "1770392639881",
    "scraped_at": "2026-02-06T17:00:05.715633Z",
    "first_discovered": "2026-02-06T17:02:30.515177+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Machine Learning Engineer - Fraud (Research Scientist)",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/e28926e1-4d8d-4419-95e2-42ade249e998",
    "job_id": "e28926e1-4d8d-4419-95e2-42ade249e998",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Data team within Plaid’s Fraud organization builds the machine learning systems that power Plaid’s cutting-edge fraud detection products. By leveraging Plaid’s extensive network data, we enable proactive fraud prevention—stopping fraud before it happens. Our team owns the entire ML lifecycle, from developing feature pipelines and training models to deploying and monitoring them in production. We ensure that our systems scale reliably and efficiently as Plaid continues to grow and support hundreds of customers.</div><div><br></div><div>As a Senior Machine Learning Engineer (Research Scientist) on Plaid’s Fraud Data team, you will design and build scalable ML infrastructure that powers our industry-leading fraud detection product. You’ll lead the evolution of our model deployment, monitoring, and observability frameworks to ensure high reliability and performance at scale. Collaborating closely with teams across ML Infrastructure, Product, and Engineering, you’ll deliver robust systems that protect users and customers from fraud. In addition, you’ll mentor other engineers and help shape the long-term technical vision and strategy of the Fraud Data team.</div><div><br></div><div>***We are open to remote candidates for this role***</div>",
    "portal": "lever",
    "posted_at": "1770361907299",
    "scraped_at": "2026-02-07T02:42:48.798784Z",
    "first_discovered": "2026-02-07T02:44:53.455800+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Customer Engineering and Support (CES) Operations Leader",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/7b9db23f-8687-4bdc-bd75-170f6d8d622f",
    "job_id": "7b9db23f-8687-4bdc-bd75-170f6d8d622f",
    "team": "Business Operations",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The Customer Engineering &amp; Support (CES) Operations team sits at the center of how we scale world-class customer experiences. As the CES Operations Leader, you will own the strategy and execution of CES Ops globally. You’ll lead a team that spans across product operations, customer experience engineering, technical enablement, and org development. You’ll partner closely with leaders in CES, Product, Engineering, and GTM to improve customer outcomes, efficiency, and quality across our customer-facing teams.</div><div><br></div>",
    "portal": "lever",
    "posted_at": "1770329028282",
    "scraped_at": "2026-02-10T19:20:18.931620Z",
    "first_discovered": "2026-02-10T19:22:18.336499+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Senior Data Scientist - Payments ACH",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/bee8c984-b6d9-4c37-a53e-a1492fe2a225",
    "job_id": "bee8c984-b6d9-4c37-a53e-a1492fe2a225",
    "team": "Engineering",
    "commitment": "",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>Plaid’s Payment Data team builds models, services, and platforms that improve how millions of users move money through ACH. We’re looking for data scientists to apply best-in-class methodologies to develop new products, enhance existing systems, and generate insights that power data-driven decision-making.</div><div><br></div><div>You’ll be a Data Scientist as a part of the Data org, tackling high-impact analytics and machine learning challenges that directly shape business outcomes. In this role, you’ll use data to drive strategic decisions, inform production direction, and evaluate and improve ML systems. You’ll partner closely with clients both pre- and post-sales to assess product performance, conduct retrospective analyses, and craft risk mitigation strategies that maximize impact.</div><div><br></div><div>Day to day, you’ll deep dive into model performance, triage issues, and identify opportunities for improvement across ML risk systems. You’ll develop new features to strengthen model performance, build scalable data pipelines using tools like dbt to automate ETL processes, and design metrics, alerts, and dashboards to monitor production models. This is an opportunity to combine analytical rigor, technical depth, and client collaboration to drive measurable results.</div>",
    "portal": "lever",
    "posted_at": "1770928409661",
    "scraped_at": "2026-02-14T02:44:37.563318Z",
    "first_discovered": "2026-02-14T02:46:35.973336+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Experienced Developer Relations Engineer - Customer Growth and Experience",
    "location": "San Francisco",
    "url": "https://jobs.lever.co/plaid/6d510dc8-2e7b-48e6-b8e8-601ca5777fa8",
    "job_id": "6d510dc8-2e7b-48e6-b8e8-601ca5777fa8",
    "team": "Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div>The mission of the Developer Relations team is to empower developers to easily use and understand Plaid’s products, delivering a supportive, industry-leading developer experience via scalable, broad-reaching methods. The scope of this role covers all of Plaid's commercially available, customer-facing products.</div><div><br></div><div>We’re looking for an experienced Developer Relations Engineer to help the world’s fintech companies (and we believe every company is a fintech company, even if they don't know it yet) integrate with Plaid's APIs. In this role, you’ll create best-in-class developer experiences, cementing Plaid's reputation as the most trustworthy, developer-friendly financial services API. This is a highly technical, highly visible role with direct impact on Plaid’s product, brand, and developer experience.</div>",
    "portal": "lever",
    "posted_at": "1771345124333",
    "scraped_at": "2026-02-17T19:10:57.493608Z",
    "first_discovered": "2026-02-17T19:13:02.821542+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Plaid",
    "title": "Privacy & Data Innovation Counsel",
    "location": "United States",
    "url": "https://jobs.lever.co/plaid/4ced8121-c5a8-4a67-af1e-44d854b05d68",
    "job_id": "4ced8121-c5a8-4a67-af1e-44d854b05d68",
    "team": "Legal",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px\">We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.</span></div><div><br></div><div><span style=\"font-size: 13.3333px;\">The Privacy &amp; Data Innovation Counsel will join Plaid’s Enterprise Legal Services team – a group of centralized legal subject-matter experts supporting all of Plaid’s functions. Our mission is to craft empathetic, forward-looking solutions that empower our stakeholders and drive innovation and competitive differentiation. We are a lean, highly collaborative team that includes Data Privacy along with other practice areas. As a member of the team, you will help round out our Data Privacy law capabilities, working alongside experienced Privacy attorneys in a fast-growing fintech company. </span></div>",
    "portal": "lever",
    "posted_at": "1771373527423",
    "scraped_at": "2026-02-18T05:03:31.984192Z",
    "first_discovered": "2026-02-18T05:05:37.027352+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  }
]