[
  {
    "company": "Rigetti Computing",
    "title": "Lead Electrical Engineer, Control Systems",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/b06e5caa-dc81-41b2-b1b0-8f118255c33a",
    "job_id": "b06e5caa-dc81-41b2-b1b0-8f118255c33a",
    "team": "Hardware Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">As a member of Rigetti’s Control Systems team, you will design, develop, test, and deploy hardware that generates microwave pulses that control and read the qubits in our quantum computer. You’ll collaborate closely with embedded software engineers, mechanical engineers, and physicists to deliver cutting-edge quantum control solutions. We’re looking for someone who will deepen our team’s expertise in low-noise mixed-signal board design — including specifying and designing critical circuit components such as low-noise power supply rails, precise clock distribution, and high-speed transceivers.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We're seeking an experienced Electrical Engineer with a proven track record of leading projects across diverse teams and driving technical excellence in fast-paced, high-growth environments. The ideal candidate combines deep technical expertise with exceptional communication and leadership skills, effectively translating complex concepts for diverse audiences and influencing key design and delivery decisions. This individual fosters a culture of innovation, accountability, and rigorous engineering design, while mentoring others to achieve their highest potential.</span></div>",
    "portal": "lever",
    "posted_at": "1745959373679",
    "scraped_at": "2026-02-05T03:03:20.880902Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Mechanical Design Engineer, Quantum Compute Hardware Systems",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/0aee8a41-8b07-4723-89c9-81f2230133a1",
    "job_id": "0aee8a41-8b07-4723-89c9-81f2230133a1",
    "team": "CryoRF",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 18px;\">About the Role</span></div><div><span style=\"font-size: 16px;\">Rigetti Computing is pioneering the development of scalable quantum computers. We’re looking for a </span><b style=\"font-size: 16px;\">Mechanical Design Engineer</b><span style=\"font-size: 16px;\"> to contribute to the design and integration of advanced hardware systems that enable the next generation of quantum computing platforms.</span></div><div><br></div><div><span style=\"font-size: 16px;\">In this role, you’ll support the design, modeling, and testing of mechanical components and assemblies that operate from room temperature down to millikelvin environments. You’ll work closely with senior engineers, physicists, and systems teams to develop precision mechanical solutions that ensure the performance and reliability of our quantum hardware.</span></div><div><br></div><div><span style=\"font-size: 16px;\">This is an excellent opportunity for a motivated engineer to grow in a multidisciplinary environment, working at the intersection of mechanical design, cryogenics, and quantum technology.</span></div>",
    "portal": "lever",
    "posted_at": "1763420857578",
    "scraped_at": "2026-02-05T03:03:20.880913Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Microwave Engineer, Quantum Processor Microwave Design",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/8871d634-607e-4b92-a536-9a14749e31d2",
    "job_id": "8871d634-607e-4b92-a536-9a14749e31d2",
    "team": "Design",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">As a Microwave Engineer in the quantum integrated circuit design team, you will drive systematic improvements to Rigetti Computing’s quantum processors through modeling and design. You will be actively involved in realizing the chips that are at the core of our technology stack. You will contribute to our full-wave electromagnetic simulation workflow and use it to model the performance of superconducting circuits. Drawing from your expertise in full-wave radio-frequency engineering, from fundamental theory through practical application, you will identify and implement improvements to the integrated circuit layout to mitigate loss and crosstalk channels. You will lay out and design microwave multi-qubit circuits for fabrication and develop next-generation quantum processors.</span></div>",
    "portal": "lever",
    "posted_at": "1762537237988",
    "scraped_at": "2026-02-05T03:03:20.880920Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Senior Equipment Maintenance Technician (Morning Shift)",
    "location": "Fremont, CA",
    "url": "https://jobs.lever.co/rigetti/a7e4fe1d-4795-4845-a4ce-9635b3868dc3",
    "job_id": "a7e4fe1d-4795-4845-a4ce-9635b3868dc3",
    "team": "Equipment, Facilities & EHS",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">Rigetti is seeking an experienced, hands-on Equipment Maintenance Technician to join the team at our Fremont Fab-1. This critical role involves the maintenance, troubleshooting, and repair of semiconductor processing tools within an R&amp;D cleanroom, supporting the fabrication of wafers for quantum computing.</span></div>",
    "portal": "lever",
    "posted_at": "1765403356901",
    "scraped_at": "2026-02-05T03:03:20.880937Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Senior Manager, Equipment Engineering",
    "location": "Fremont, CA",
    "url": "https://jobs.lever.co/rigetti/93388dcf-8744-44c8-b061-46cf0f27d848",
    "job_id": "93388dcf-8744-44c8-b061-46cf0f27d848",
    "team": "Equipment, Facilities & EHS",
    "commitment": "Full-time",
    "description": "<div><b style=\"font-size: 16px;\">About the Role</b></div><div><span style=\"font-size: 16px;\">Rigetti Computing is seeking a hands-on, technically driven Senior Manager of Equipment to support our wafer fabrication facility in Fremont. In this role, you’ll ensure the reliability and safety of a complex R&amp;D environment that includes many fabrication tools spanning high-vacuum deposition, lithography, etch, packaging and metrology areas.</span></div><div><br></div><div><span style=\"font-size: 16px;\">You’ll oversee fab equipment operations and maintenance, manage hazardous materials and waste handling, and partner with facilities and EHS teams to maintain a safe, compliant, and high-performing environment. You will collaborate closely with fabrication engineers to understand tool requirements and with engineering operations to ensure alignment between process and infrastructure systems.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We’re looking for someone who is data-driven and approaches problems systematically. You understand how individual tools, facilities systems, and processes connect, and use maintenance data and metrics to anticipate issues before they arise. This is a highly technical, hands-on role suited for someone who thrives in the details - debugging complex systems, planning upgrades, and working cross-functionally to keep the Fab running at peak performance.</span></div>",
    "portal": "lever",
    "posted_at": "1765229200114",
    "scraped_at": "2026-02-05T03:03:20.880944Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Senior Quantum Engineer, Quantum Integrated Circuit Design and Simulation Automation",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/5a9e146f-164e-42b5-a463-1d90b5eb145e",
    "job_id": "5a9e146f-164e-42b5-a463-1d90b5eb145e",
    "team": "Design",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">As a Quantum Engineer in the quantum integrated circuit design team, you will transform our quantum integrated circuit design and simulation workflow, enabling Rigetti to model increasingly complex and larger scale quantum processors, at the 1000Q scale and beyond. Leveraging your experience in computational electromagnetics and commercially available electromagnetic solvers in conjunction with a strong software engineering background, you will accelerate the simulation and optimization of quantum integrated circuits. You will improve both the automation of our modeling tools and the techniques used to simulate our designs, both classically and in the quantum regime, through your expertise in numerical methods and high performance computing.</span></div>",
    "portal": "lever",
    "posted_at": "1762537012902",
    "scraped_at": "2026-02-05T03:03:20.880949Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Senior Quantum Engineer, Readout",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/2a4c64d5-92c7-426c-89d0-7197781ef086",
    "job_id": "2a4c64d5-92c7-426c-89d0-7197781ef086",
    "team": "Quantum Engineering",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">As Senior Quantum Engineer, Readout, you will optimize superconducting qubit readout and reset on Rigetti’s quantum processors and fault-tolerant prototypes. You will lead a range of experimental efforts to characterize and improve measurement protocols, signal chains, amplifiers, and device layouts. In collaboration with an interdisciplinary group of engineers in theory, hardware, and chip design, you will advance the speed and fidelity of readout and reset in Rigetti Computing’s quantum computing systems to fulfill its ambitious roadmap toward fault tolerance.</span></div>",
    "portal": "lever",
    "posted_at": "1761341662610",
    "scraped_at": "2026-02-05T03:03:20.880955Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Senior Software Engineer, Compute Infrastructure",
    "location": "Berkeley, CA",
    "url": "https://jobs.lever.co/rigetti/951a71d3-2155-4e4b-8c7a-27060f45e87c",
    "job_id": "951a71d3-2155-4e4b-8c7a-27060f45e87c",
    "team": "QPU Software",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">Rigetti Computing is building the world’s most powerful computers to solve humanity’s most pressing problems. We believe this technology will fundamentally change the world for the better and will affect nearly every industry over the coming decades.&nbsp; </span></div><div><br></div><div><span style=\"font-size: 16px;\">As a Senior Software Engineer for Compute Infrastructure, you are responsible for helping to build and maintain Rigetti’s core cloud infrastructure. You will help own/implement and maintain the vital systems that power all aspects of our business and you’ll work cross functionally with world-class engineers and physicists to pioneer the most advanced Quantum Compute Platform in the world. This is a rare opportunity to combine onsite quantum infrastructure with modern cloud technology.</span></div><div><br></div><div>Location Note: You'll keep a hybrid work schedule, present for at least 3 days a week in our Berkeley office. Your physical systems and your key customers are there, and you need to know them, spend time with them, understand them, and help them.</div>",
    "portal": "lever",
    "posted_at": "1736890564300",
    "scraped_at": "2026-02-05T03:03:20.880989Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  },
  {
    "company": "Rigetti Computing",
    "title": "Supply Chain Lead",
    "location": "Berkeley, CA or Fremont, CA",
    "url": "https://jobs.lever.co/rigetti/91d968c9-3dce-4c61-b472-8bfa24b81624",
    "job_id": "91d968c9-3dce-4c61-b472-8bfa24b81624",
    "team": "Supply Chain",
    "commitment": "Full-time",
    "description": "<div><span style=\"font-size: 16px;\">Rigetti Computing is building the world’s most powerful computers to solve humanity’s most pressing problems. We believe this technology will fundamentally change the world for the better and will affect nearly every industry over the coming decades.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">As Supply Chain Lead, you will have responsibilities from end-to-end in supply chain strategy, operations, and execution for advanced quantum hardware and subsystem components. You will manage high-complexity sourcing, logistics, partner relationships, risk mitigation, and continuous optimization to support scalable quantum system builds. And you’ll partner closely with engineering, product, operations, and quality teams to deliver mission-critical supply of high-precision components under tight tolerances, lead times, and regulatory constraints. This role requires someone who can navigate a nascent, high-technology supply base (e.g. for lasers, optics, cryogenic systems, control electronics, qubit materials) and build robust supply chains under uncertainty.</span></div><div><br></div>",
    "portal": "lever",
    "posted_at": "1759334632463",
    "scraped_at": "2026-02-05T03:03:20.880996Z",
    "first_discovered": "2026-02-05T03:05:09.991016+00:00Z",
    "times_seen": 1,
    "hours_old": 0.0,
    "days_old": 0,
    "apply_priority": "HIGH",
    "freshness_score": 100
  }
]